OpenFOAM_Maincode/tutorials/multiRegion/CHT/VoFcoolingCylinder2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication splitMeshRegions -cellZones -overwrite

runApplication setFields -region fluid

paraFoam -region fluid -touch
paraFoam -region solid -touch

runApplication $(getApplication)

#------------------------------------------------------------------------------
